Case_4/CFD/0/impParticleForces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      impParticleForces;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 1 -2 0 0 0 0];

internalField   nonuniform List<vector> 
1300
(
(4.84933e-05 -2.95251e-08 8.37649e-08)
(4.84419e-05 -3.00002e-08 8.67613e-08)
(4.8252e-05 -3.17564e-08 9.78411e-08)
(4.79764e-05 -3.43022e-08 1.1397e-07)
(4.76944e-05 -3.68862e-08 1.31522e-07)
(4.75141e-05 -3.85029e-08 1.44507e-07)
(4.72918e-05 -4.04651e-08 1.62078e-07)
(4.70973e-05 -4.21415e-08 1.79395e-07)
...
)
;

boundaryField
{
    wall_bottom
    {
        type            calculated;
        value           uniform (4.85065e-05 -2.9403e-08 8.29949e-08);
    }
    wall_top
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    front1
    {
        type            cyclic;
    }
    back1
    {
        type            cyclic;
    }
    left1
    {
        type            cyclic;
    }
    right1
    {
        type            cyclic;
    }
    front2
    {
        type            cyclic;
    }
    back2
    {
        type            cyclic;
    }
    left2
    {
        type            cyclic;
    }
    right2
    {
        type            cyclic;
    }
}


// ************************************************************************* //
